#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>
#include<math.h>

//1.
//倒序输出
//依次输入4个整数a、b、c、d, 将他们倒序输出，即依次输出d、c、b、a这4个数。
//
//时间限制：1000
//内存限制：65536
//输入
//一行4个整数a、b、c、d，以空格分隔。 0 < a, b, c, d < 108
//	输出
//	一行4个整数d、c、b、a，整数之间以一个空格分隔。
//	样例输入
//	1 2 3 4
//	样例输出
//	4 3 2 1

//int main()
//{
//	int a, b, c, d;
//	scanf("%d%d%d%d", &a, &b, &c, &d);
//	printf("%d %d %d %d \n", d, c, b, a);
//	return 0;
//}

//平方差计算
//给定的两个整数a, b, 他们的平方差结果为a2 - b2 ，可以化简为(a + b)(a - b)。例如5和4的平方差为52 - 42 = (5 + 4)(5 - 4) = 9。现给定两个整数，求他们的平方差。
//
//时间限制：1000
//内存限制：65536
//输入
//一行两个整数a、b，以空格分隔。 0 < b < a < 104
//	输出
//	输出a和b的平方差
//	样例输入
//	5 4
//	样例输出
//	9

//int main()
//{
//	int a = 0;
//	int b = 0;
//	scanf("%d%d", &a, &b);
//	int re = pow(a, 2) - pow(b, 2);
//	printf("%d\n", re);
//	return 0;
//}

//最小的数
//依次输入3个整数a、b、c, 将a、b、c中的最小值输出。
//
//时间限制：1000
//内存限制：65536
//输入
//一行3个整数a、b、c，以空格分隔。 0 < a, b, c < 108
//	输出
//	1个整数，即3个整数的最小值。
//	样例输入
//	2 3 2
//	样例输出
//	2

//int main()
//{
//	int a, b, c;
//	scanf("%d%d%d", &a, &b, &c);
//	int min = a;
//	if (min > b)
//	{
//		min = b;
//	}
//	if (min > c)
//	{
//		min = c;
//	}
//	printf("%d\n", min);
//	return 0;
//}

//计算成绩优秀的人数
//现有一个班一门课程考试的分数，请统计其中成绩为优秀的人数。成绩为优秀的要求是分数大于等于85。
//
//时间限制：1000
//内存限制：65536
//输入
//第一行1个整数n，表示分数的个数。（0 < n ≤ 100, ） 第二行n个正整数，表示每一个分数，每个分数小于等于100。
//	输出
//	输出一个整数，表示成绩为优秀的人数。
//	样例输入
//	10
//	85 70 99 90 78 55 100 62 88 84
//	样例输出
//	5
// 


//以下代码是否可行
//int main()
//{
//	int n = 0;
//	int count = 0;
//	char arr[100] = { 0 };
//	scanf("%d", &n);
//	for (int i = 0; i < n; i++)
//		arr[i] = '%d';
//	arr[n] = '\0';
//	scanf("%s", arr);
//	for (int i = 0; i < n; i++)
//	{
//		if (((int)arr[i]) > 85)
//		{
//			count++;
//		}
//	}
//	printf("%d", count);
//	return 0;
//}

//
//int main()
//{
//	int n = 0;
//	int score = 0;
//	int count = 0;
//	scanf("%d", &n);
//	do
//	{
//		scanf("%d", &score);
//		if (score >= 85)
//		{
//			count++;
//		}
//		n--;
//	} while (n);
//	printf("%d\n", count);
//	return 0;
//}

//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int count = 0;
//	int arr[] = { 0 };
//	for (int i = 0; i < n; i++)
//	{
//		scanf("%d", arr + i);
//		if (arr[i] > 85)
//		{
//			count++;
//		}
//	}
//	printf("%d", count);
//	return 0;
//}

//开关灯
//假设有N盏灯(N为不大于5000的正整数)，从1到N按顺序依次编号，初始时全部处于开启状态；有M个人(M为不大于N的正整数)也从1到M依次编号。
//
//第一个人（1号）将灯全部关闭，第二个人（2号）将编号为2的倍数的灯打开，第三个人（3号）将编号为3的倍数的灯做相反处理（即，将打开的灯关闭，将关闭的灯打开）。依照编号递增顺序，以后的人都和3号一样，将凡是自己编号倍数的灯做相反处理。
//
//请问：当第M个人操作之后，哪几盏灯是关闭的，按从小到大输出其编号，其间用逗号间隔。
//
//时间限制：1000
//内存限制：65536
//输入
//输入正整数N和M，以单个空格隔开。
//输出
//顺次输出关闭的灯的编号，其间用逗号间隔。
//样例输入
//10 10
//样例输出
//1, 4, 9

//int main()
//{
//	int N,M;
//	scanf("%d%d", &N, &M);
//	//-1为关，1为开
//	//创建N个灯的数组，全为开。
//	int arr[5000] = { 0 };
//	int i = 0;
//	for (i = 0; i < N; i++)
//	{
//		arr[i] = 1;
//	}
//	//从第一个人到M号人的操作如下
//	int j = 0;
//	for (j = 1; j <= M; j++)
//	{
//		//j号人时，遍历每个灯的操作
//		for (i = 1; i <= N; i++)
//		{
//			if (i%j==0)
//			{
//				arr[i-1] = -arr[i-1];
//			}
//		}
//	}
//	//遍历看哪些灯为关，即数组哪些值是-1
//	for (i = 1; i <= N; i++)
//	{
//		if (arr[i-1] == -1)
//		{
//			printf("%d ", i);
//		}
//	}
//	return 0;
//}