#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//加一
//输入一个整数x，输出这个整数加1后的值，即x + 1的值。
//
//时间限制：1000
//内存限制：65536
//输入
//一个整数x（0 ≤ x ≤ 1000）。
//输出
//按题目要求输出一个整数。
//样例输入
//9
//样例输出
//10

//int main()
//{
//	int x = 0;
//	scanf("%d", &x);
//	printf("%d", x + 1);
//	return 0;
//}

//(a / b)* c的值
//给定整数a、b、c，计算(a / b)* c的值，这里的除法为实数除法。
//
//时间限制：1000
//内存限制：65536
//输入
//一行，三个整数a、b、c，整数间以空格分隔。（1 ≤ a, b, c ≤ 1000）
//输出
//将计算结果保留6位小数输出。
//样例输入
//1 3 3
//样例输出
//1.000000

//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	scanf("%d%d%d", &a, &b, &c);
//	float f = a *c/ b;
//	printf("%lf", f);
//	return 0;
//
//}

//判断是否存在重复的数
//给定3个数，判断是否存在2个数相等，如果存在输出"YES", 否者输出"NO"。
//
//时间限制：5000
//内存限制：65536
//输入
//1行，包含3个整数，以空格分隔。
//输出
//按照题目要求输出结果
//样例输入
//2 7 2
//样例输出
//YES

//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	scanf("%d%d%d", &a, &b, &c);
//	if (a == b | b == c | a == c)
//	{
//		printf("YES");
//	}
//	else
//	{
//		printf("NO");
//	}
//	return 0;
//}

//整数的立方和
//给定一个正整数k（1
//时间限制：1000
//内存限制：65536
//输入
//输入只有一行，该行包含一个正整数k。
//输出
//输出只有一行，该行包含1到k的立方和。
//样例输入
//5
//样例输出
//225

//int main()
//{
//	int k = 0;
//	int i = 0;
//	int sum = 0;
//	scanf("%d", &k);
//	for (i = 1; i <= k; i++)
//	{
//		sum += i * i * i;
//	}
//	printf("%d\n",sum);
//	return 0;
//}

//#include<math.h>
//int main()
//{
//	int k = 0;
//	int i = 0;
//	int sum = 0;
//	scanf("%d", &k);
//	for (i = 1; i <= k; i++)
//	{
//		sum += pow(i,3);
//	}
//	printf("%d\n",sum);
//	return 0;
//}

//自整除数
//对一个整数n, 如果其各个位数的数字相加得到的数m能整除n, 则称n为自整除数.例如21, 21 % (2 + 1) == 0, 所以21是自整除数.现求出从10到n(n < 100)之间的所有自整除数.
//
//	时间限制：1000
//	内存限制：65536
//	输入
//	有一行, 整数n, (10 <= n < 100)
//	输出
//	有多行.按从小到大的顺序输出所有大于等于10, 小于等于n的自整除数, 每行一个自整除数.
//	样例输入
//	47
//	样例输出
//	10
//	12
//	18
//	20
//	21
//	24
//	27
//	30
//	36
//	40
//	42
//	45

int main()
{
	int n = 0;
	int i = 0;
	scanf("%d", &n);
	for (i = 10; i <= n; i++)
	{
		if ((i % (i / 10 + i % 10)) == 0)
		{
			printf("%d\n",i);
		}
	}
	return 0;
}