#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//1.
//指定顺序输出
//依次输入3个整数a、b、c, 将他们以c、a、b的顺序输出。
//
//时间限制：1000
//内存限制：65536
//输入
//一行3个整数a、b、c，以空格分隔。 0 < a, b, c < 108
//	输出
//	一行3个整数c、a、b，整数之间以一个空格分隔。
//	样例输入
//	1 2 3
//	样例输出
//	3 1 2

//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	scanf("%d%d%d", &a, &b, &c);
//	printf("%d %d %d \n", c, a, b);
//	return 0;
//}

//
//成绩判定
//给定一门课的考试分数，如果分数大于等于60，则该门课成绩合格，记为"P", 否者成绩不合格，记为"F"。
//
//时间限制：1000
//内存限制：65536
//输入
//一个整数s，表示这门课的分数.(0 ≤ s ≤ 100)
//输出
//如果成绩合格，输出字母P，否者输出字母F。
//样例输入
//59
//样例输出
//F
//
//int main()
//{
//	int a = 0;
//	scanf("%d", &a);
//	if (a >= 60)
//	{
//		printf("P");
//	}
//	else
//	{
//		printf("F");
//	}
//	return 0;
//}

//简单排序
//依次输入3个整数a、b、c, 将他们从小到大的顺序输出。
//
//时间限制：1000
//内存限制：65536
//输入
//一行3个整数a、b、c，以空格分隔。 0 < a, b, c < 108
//	输出
//	一行3个整数，即将a、b、c从小到大排序的3个整数，整数之间以一个空格分隔。
//	样例输入
//	10 5 20
//	样例输出
//	5 10 20
//int cp(int x, int y)
//{
//	return x < y? x:y;
//}
//
//int main()
//{
//	int a = 0;
//	int b = 0;
//	int c = 0;
//	scanf("%d%d%d", &a, &b, &c);
//	int arr[3] = { a,b,c };
//	int i = 0;
//	for (i = 0; i < 2; i++)
//	{
//		if (arr[i] > arr[i+1]);
//		{
//			int tem = arr[i];
//			arr[i] = arr[i + 1];
//			arr[i + 1] = tem;
//		}
//	}
//	if (arr[1] > arr[2])
//	{
//		int tem = arr[1];
//		arr[1] = arr[2];
//		arr[2] = tem;
//	}
//	printf("%d %d %d\n", arr[0], arr[1], arr[2]);
//	return 0;
//}

//数字求和
//给定一个正整数a，以及另外的5个正整数，问题是：这5个整数中，小于a的整数的和是多少？
//时间限制：3000
//内存限制：65536
//输入
//输入一行，只包括6个小于100的正整数，其中第一个正整数就是a。
//输出
//输出一行，给出一个正整数，是5个数中小于a的数的和。
//样例输入
//10 1 2 3 4 11
//样例输出
//10

//int main()
//{
//	int a,b,c,d,e,f;
//	int i = 0;
//	int sum = 0;
//	scanf("%d %d %d %d %d %d", &a,&b,&c,&d,&e,&f);
//	if (b < a)
//	{
//		sum += b;
//	}
//	if (c < a)
//	{
//		sum += c;
//	}
//	if (d < a)
//	{
//		sum += d;
//	}
//	if (e < a)
//	{
//		sum += e;
//	}
//	if (f < a)
//	{
//		sum += f;
//	}
//	printf("%d\n", sum);
//	return 0;
//}

//数1的个数
//给定一个十进制正整数n，写下从1到n的所有整数，然后数一下其中出现的数字“1”的个数。
//
//例如当n = 2时，写下1, 2。这样只出现了1个“1”；当n = 12时，写下1，2，3，4，5，6，7，8，9，10，11，12。这样出现了5个“1”。
//
//时间限制：1000
//内存限制：65536
//输入
//正整数n。1 <= n <= 10000。
//输出
//一个正整数，即“1”的个数。
//样例输入
//12
//样例输出
//5

//int main()
//{
//	int n = 0;
//	int i = 0;
//	int count = 0;
//	scanf("%d", &n);
//	for (i = 1; i <= n; i++)
//	{
//		int x = i;
//		while (x)
//		{
//			if (x % 10 == 1)
//			{
//				count++;
//			}
//			x /= 10;
//		}
//	}
//	printf("%d", count);
//	return 0;
//}