#define _CRT_SECURE_NO_WARNINGS 1

#include<stdio.h>

//字符长方形
//给定一个字符，用它构造一个长为4个字符，宽为3个字符的长方形，可以参考样例输出。
//
//时间限制：1000
//内存限制：65536
//输入
//输入只有一行， 包含一个字符。
//输出
//该字符构成的长方形，长4个字符，宽3个字符。
//样例输入
//*
//样例输出
//****
//****
//****

//void pp(char a)
//{
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 3; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//			printf("%c", a);
//		}
//		printf("\n");
//	}
//}
//
//int main()
//{
//	char a = 0;
//	scanf("%c", &a);
//	pp(a);
//	return 0;
//}

//长方形面积
//给出一个长方形的长和宽，求该长方形的面积。假设长为a，宽为b，则面积S = a×b。
//
//时间限制：1000
//内存限制：65536
//输入
//一行，2个正整数，以空格分隔，分别表示长方形的长和宽。长和宽都不大于1000。
//输出
//一个整数，即长方形的面积。
//样例输入
//4 3
//样例输出
//12

//int main()
//{
//	int a = 0;
//	int b = 0;
//	scanf("%d%d", &a, &b);
//	int s = a * b;
//	printf("一个整数，即长方形的面积为：%d", s);
//	return 0;
//}

//成绩等级转换
//小明想将自己的百分制成绩转换为等级制，请你帮他完成这样的转换。转换规则为：
//
//A，90 - 100
//
//B，77 - 89
//
//C，67 - 76
//
//D，60 - 66
//
//E，0 - 59
//
//时间限制：1000
//内存限制：65536
//输入
//一个0 - 100 的整数
//输出
//输出转换后的等级，一个A - E的大写字母。
//样例输入
//样例1 :
//85
//样例2 :
//	62
//样例输出
//样例1 :
//B
//样例2 :
//D

//void pd(int x)
//{
//	if (90 <= x && x <= 100)
//	{
//		printf("A\n");
//	}
//	else if(77 <= x && x <= 89)
//	{
//		printf("B\n");
//	}
//	else if(67 <= x && x <= 76)
//	{
//		printf("C\n");
//	}
//	else if (60 <= x && x <= 66)
//	{
//		printf("D\n");
//	}
//	else if (0 <= x && x <= 59)
//	{
//		printf("E\n");
//	}
//	else if (x==-1)
//	{
//		printf("exit");
//	}
//	else
//	{
//		printf("输入错误，重新输入");
//	}
//}
//
//void pp()
//{
//	printf("****************************\n");
//	printf("*****    A，90 - 100   *****\n");
//	printf("*****    B，77 - 89    *****\n");
//	printf("*****    C，67 - 76    *****\n");
//	printf("*****    D，60 - 66    *****\n");
//	printf("*****    E，0 - 59     *****\n");
//	printf("*****	 -1, exit      *****\n");
//	printf("****************************\n");
//
//}
//
//int main()
//{
//	int input = 0;
//	do
//	{
//		pp();
//		scanf("%d", &input);
//		pd(input);
//	} while (input+1);
//	
//}

//机智的小明
//小明的妈妈非常关心小明的成绩，每次考试后都会问小明是否进步了。机智的小明会努力找出之前比这次成绩低的试卷进行比较，如果找到了，他会回答妈妈自己进步了（Y），如果没找到，他只能回答妈妈没进步（N）。已知小明的n次成绩，请问每次妈妈询问小明，小明的回答是怎么样的。
//
//时间限制：1000
//内存限制：65536
//输入
//输入为2行，第1行是一个整数n(n < 100)，即考试成绩的数量，第二行是n个整数，即每次考试成绩。输入保证n不大于100，考试成绩在0到100之间。
//	输出
//	n行，每行是小明的回答（Y或N）
//	样例输入
//	5
//	90 80 95 96 50
//	样例输出
//	N
//	N
//	Y
//	Y
//	N
//	提示
//	对于每一次成绩，只要之前的成绩有任意一次成绩比当前成绩低，就输出Y，否则输出N

//int main()
//{
//	int i = 0;
//	int n = 0;
//	int score = 0;
//	int min = 100;
//	scanf("%d", &n);
//	for (i = 0; i < n; i++)
//	{
//		scanf("%d", &score);
//		if (min < score)
//		{
//			printf("Y\n");
//		}
//		else
//		{
//			printf("N\n");
//			min = score;
//		}
//	}
//	return 0;
//}

//寻找特殊年号
//年号中的每个数之和为20的年号是特殊年号。例如：2099、1991、1892是特殊的年号，而2021则不是。给定一个年号，找出严格大于给定年号的最小特殊年号。
//
//时间限制：1000
//内存限制：65535
//输入
//年号：整数y(1000≤y≤9000)。
//输出
//特殊年号：严格意义上大于y的最小年号，并且它的每个数之和为20。
//样例输入
//# 样例输入1
//1892
//
//# 样例输入2
//2021
//样例输出
//# 样例输出1
//1919
//
//# 样例输出2
//2099
//提示
//因为2 + 0 + 9 + 9 = 20，所以2099是特殊年号。 因为2 + 0 + 2 + 1 = 5，所以2021不是特殊年号。 特殊年号可能大于9000。

//int main()
//{
//	int n = 0;
//	scanf("%d", &n);
//	int i = 0;
//	int m = 0;
//	n++;
//	while ((++n/1000+n/100%10+n/10%10+n%10) != 20)
//	{
//	}
//	printf("%d要找的最小特殊年", n);
//	return 0;
//}